app/controllers/yojo_controller.rb

    def sample_kitchen
        respond_to do |format|
            format.html
            if params[:id] == '1'
                format.json { @ingredients = Ingredient.search(params[:term]) }
            elsif params[:id] == '2'
                format.json { @seasonings = Seasoning.search(params[:term]) }
---
SELECT "ingredients".* FROM "ingredients" WHERE (name LIKE '%$')
SELECT "seasonings".* FROM "seasonings" WHERE (name LIKE '%t%')